app/controllers/payslips_controller.rb

  def index
    @tax_range_empty ||= TaxRange.all.empty?
---
SELECT COUNT(*) FROM "tax_ranges"

  def set_form_params
    @employees_for_select ||= Employee.all
---
SELECT "employees".* FROM "employees"