app/controllers/tax_ranges_controller.rb

  def index
    @tax_ranges = TaxRange.all
---
SELECT "tax_ranges".* FROM "tax_ranges"